Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAR176.atdf
         <register caption="ADC Base Register" name="ADCBASE" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ADCBASE" />
         </register>
         <register caption="ADC Trigger Level/Edge Sensitivity Register" name="ADCTRGSNS" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Trigger Level and Edge Sensitivity bit 0" mask="0x00000001" name="LVL0" values="ADCTRGSNS__LVL0" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 1" mask="0x00000002" name="LVL1" values="ADCTRGSNS__LVL1" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 2" mask="0x00000004" name="LVL2" values="ADCTRGSNS__LVL2" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 3" mask="0x00000008" name="LVL3" values="ADCTRGSNS__LVL3" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 4" mask="0x00000010" name="LVL4" values="ADCTRGSNS__LVL4" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 5" mask="0x00000020" name="LVL5" values="ADCTRGSNS__LVL5" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 6" mask="0x00000040" name="LVL6" values="ADCTRGSNS__LVL6" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 7" mask="0x00000080" name="LVL7" values="ADCTRGSNS__LVL7" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 8" mask="0x00000100" name="LVL8" values="ADCTRGSNS__LVL8" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 9" mask="0x00000200" name="LVL9" values="ADCTRGSNS__LVL9" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 10" mask="0x00000400" name="LVL10" values="ADCTRGSNS__LVL10" />
            <bitfield caption="Trigger Level and Edge Sensitivity bit 11" mask="0x00000800" name="LVL11" values="ADCTRGSNS__LVL11" />
            <bitfield mask="0x00001000" name="LVL12" />
            <bitfield mask="0x00002000" name="LVL13" />
            <bitfield mask="0x00004000" name="LVL14" />
            <bitfield mask="0x00008000" name="LVL15" />
            <bitfield mask="0x00010000" name="LVL16" />
            <bitfield mask="0x00020000" name="LVL17" />
            <bitfield mask="0x00040000" name="LVL18" />
            <bitfield mask="0x00080000" name="LVL19" />
            <bitfield mask="0x00100000" name="LVL20" />
            <bitfield mask="0x00200000" name="LVL21" />
            <bitfield mask="0x00400000" name="LVL22" />
            <bitfield mask="0x00800000" name="LVL23" />
            <bitfield mask="0x01000000" name="LVL24" />
            <bitfield mask="0x02000000" name="LVL25" />
            <bitfield mask="0x04000000" name="LVL26" />
            <bitfield mask="0x08000000" name="LVL27" />
            <bitfield mask="0x10000000" name="LVL28" />
            <bitfield mask="0x20000000" name="LVL29" />
            <bitfield mask="0x40000000" name="LVL30" />
            <bitfield mask="0x80000000" name="LVL31" />
         </register>
         <register caption="Dedicated ADCx Timing Register x (x = 0 through 4)" name="ADC0TIME" offset="0xd4" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS" />
         </register>
         <register caption="Dedicated ADCx Timing Register x (x = 0 through 4)" name="ADC1TIME" offset="0xd8" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC1TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC1TIME__ADCDIV" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC1TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC1TIME__ADCEIS" />
         </register>
         <register caption="Dedicated ADCx Timing Register x (x = 0 through 4)" name="ADC2TIME" offset="0xdc" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC2TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC2TIME__ADCDIV" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC2TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC2TIME__ADCEIS" />
         </register>
         <register caption="Dedicated ADCx Timing Register x (x = 0 through 4)" name="ADC3TIME" offset="0xe0" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC3TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC3TIME__ADCDIV" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC3TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC3TIME__ADCEIS" />
         </register>
         <register caption="Dedicated ADCx Timing Register x (x = 0 through 4)" name="ADC4TIME" offset="0xe4" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC4TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC4TIME__ADCDIV" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC4TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC4TIME__ADCEIS" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 1" name="ADCEIEN1" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bit 0" mask="0x00000001" name="EIEN0" values="ADCEIEN1__EIEN0" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 1" mask="0x00000002" name="EIEN1" values="ADCEIEN1__EIEN1" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 2" mask="0x00000004" name="EIEN2" values="ADCEIEN1__EIEN2" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 3" mask="0x00000008" name="EIEN3" values="ADCEIEN1__EIEN3" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 4" mask="0x00000010" name="EIEN4" values="ADCEIEN1__EIEN4" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 5" mask="0x00000020" name="EIEN5" values="ADCEIEN1__EIEN5" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 6" mask="0x00000040" name="EIEN6" values="ADCEIEN1__EIEN6" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 7" mask="0x00000080" name="EIEN7" values="ADCEIEN1__EIEN7" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 8" mask="0x00000100" name="EIEN8" values="ADCEIEN1__EIEN8" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 9" mask="0x00000200" name="EIEN9" values="ADCEIEN1__EIEN9" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 10" mask="0x00000400" name="EIEN10" values="ADCEIEN1__EIEN10" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 11" mask="0x00000800" name="EIEN11" values="ADCEIEN1__EIEN11" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 12" mask="0x00001000" name="EIEN12" values="ADCEIEN1__EIEN12" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 13" mask="0x00002000" name="EIEN13" values="ADCEIEN1__EIEN13" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 14" mask="0x00004000" name="EIEN14" values="ADCEIEN1__EIEN14" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 15" mask="0x00008000" name="EIEN15" values="ADCEIEN1__EIEN15" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 16" mask="0x00010000" name="EIEN16" values="ADCEIEN1__EIEN16" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 17" mask="0x00020000" name="EIEN17" values="ADCEIEN1__EIEN17" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 18" mask="0x00040000" name="EIEN18" values="ADCEIEN1__EIEN18" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 19" mask="0x00080000" name="EIEN19" values="ADCEIEN1__EIEN19" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 20" mask="0x00100000" name="EIEN20" values="ADCEIEN1__EIEN20" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 21" mask="0x00200000" name="EIEN21" values="ADCEIEN1__EIEN21" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 22" mask="0x00400000" name="EIEN22" values="ADCEIEN1__EIEN22" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 23" mask="0x00800000" name="EIEN23" values="ADCEIEN1__EIEN23" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 24" mask="0x01000000" name="EIEN24" values="ADCEIEN1__EIEN24" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 25" mask="0x02000000" name="EIEN25" values="ADCEIEN1__EIEN25" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 26" mask="0x04000000" name="EIEN26" values="ADCEIEN1__EIEN26" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 27" mask="0x08000000" name="EIEN27" values="ADCEIEN1__EIEN27" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 28" mask="0x10000000" name="EIEN28" values="ADCEIEN1__EIEN28" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 29" mask="0x20000000" name="EIEN29" values="ADCEIEN1__EIEN29" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 30" mask="0x40000000" name="EIEN30" values="ADCEIEN1__EIEN30" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 31" mask="0x80000000" name="EIEN31" values="ADCEIEN1__EIEN31" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 2" name="ADCEIEN2" offset="0xf4" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bit 32" mask="0x00000001" name="EIEN32" values="ADCEIEN2__EIEN32" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 33" mask="0x00000002" name="EIEN33" values="ADCEIEN2__EIEN33" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 34" mask="0x00000004" name="EIEN34" values="ADCEIEN2__EIEN34" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 35" mask="0x00000008" name="EIEN35" values="ADCEIEN2__EIEN35" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 36" mask="0x00000010" name="EIEN36" values="ADCEIEN2__EIEN36" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 37" mask="0x00000020" name="EIEN37" values="ADCEIEN2__EIEN37" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 38" mask="0x00000040" name="EIEN38" values="ADCEIEN2__EIEN38" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 39" mask="0x00000080" name="EIEN39" values="ADCEIEN2__EIEN39" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 40" mask="0x00000100" name="EIEN40" values="ADCEIEN2__EIEN40" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 41" mask="0x00000200" name="EIEN41" values="ADCEIEN2__EIEN41" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 42" mask="0x00000400" name="EIEN42" values="ADCEIEN2__EIEN42" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 43" mask="0x00000800" name="EIEN43" values="ADCEIEN2__EIEN43" />
            <bitfield caption="Early Interrupt Enable for Analog Input bit 44" mask="0x00001000" name="EIEN44" values="ADCEIEN2__EIEN44" />
            <bitfield mask="0x00002000" name="EIEN45" />
            <bitfield mask="0x00004000" name="EIEN46" />
            <bitfield mask="0x00008000" name="EIEN47" />
            <bitfield mask="0x00010000" name="EIEN48" />
            <bitfield mask="0x00020000" name="EIEN49" />
            <bitfield mask="0x00040000" name="EIEN50" />
            <bitfield mask="0x00080000" name="EIEN51" />
            <bitfield mask="0x00100000" name="EIEN52" />
            <bitfield mask="0x00200000" name="EIEN53" />
            <bitfield mask="0x00400000" name="EIEN54" />
            <bitfield mask="0x00800000" name="EIEN55" />
            <bitfield mask="0x01000000" name="EIEN56" />
            <bitfield mask="0x02000000" name="EIEN57" />
            <bitfield mask="0x04000000" name="EIEN58" />
            <bitfield mask="0x08000000" name="EIEN59" />
            <bitfield mask="0x10000000" name="EIEN60" />
            <bitfield mask="0x20000000" name="EIEN61" />
            <bitfield mask="0x40000000" name="EIEN62" />
            <bitfield mask="0x80000000" name="EIEN63" />
         </register>
         <register caption="ADC Early Interrupt Status Register 1" name="ADCEISTAT1" offset="0xf8" rw="R" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 0" mask="0x00000001" name="EIRDY0" values="ADCEISTAT1__EIRDY0" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 1" mask="0x00000002" name="EIRDY1" values="ADCEISTAT1__EIRDY1" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 2" mask="0x00000004" name="EIRDY2" values="ADCEISTAT1__EIRDY2" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 3" mask="0x00000008" name="EIRDY3" values="ADCEISTAT1__EIRDY3" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 4" mask="0x00000010" name="EIRDY4" values="ADCEISTAT1__EIRDY4" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 5" mask="0x00000020" name="EIRDY5" values="ADCEISTAT1__EIRDY5" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 6" mask="0x00000040" name="EIRDY6" values="ADCEISTAT1__EIRDY6" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 7" mask="0x00000080" name="EIRDY7" values="ADCEISTAT1__EIRDY7" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 8" mask="0x00000100" name="EIRDY8" values="ADCEISTAT1__EIRDY8" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 9" mask="0x00000200" name="EIRDY9" values="ADCEISTAT1__EIRDY9" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 10" mask="0x00000400" name="EIRDY10" values="ADCEISTAT1__EIRDY10" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 11" mask="0x00000800" name="EIRDY11" values="ADCEISTAT1__EIRDY11" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 12" mask="0x00001000" name="EIRDY12" values="ADCEISTAT1__EIRDY12" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 13" mask="0x00002000" name="EIRDY13" values="ADCEISTAT1__EIRDY13" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 14" mask="0x00004000" name="EIRDY14" values="ADCEISTAT1__EIRDY14" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 15" mask="0x00008000" name="EIRDY15" values="ADCEISTAT1__EIRDY15" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 16" mask="0x00010000" name="EIRDY16" values="ADCEISTAT1__EIRDY16" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 17" mask="0x00020000" name="EIRDY17" values="ADCEISTAT1__EIRDY17" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 18" mask="0x00040000" name="EIRDY18" values="ADCEISTAT1__EIRDY18" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 19" mask="0x00080000" name="EIRDY19" values="ADCEISTAT1__EIRDY19" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 20" mask="0x00100000" name="EIRDY20" values="ADCEISTAT1__EIRDY20" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 21" mask="0x00200000" name="EIRDY21" values="ADCEISTAT1__EIRDY21" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 22" mask="0x00400000" name="EIRDY22" values="ADCEISTAT1__EIRDY22" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 23" mask="0x00800000" name="EIRDY23" values="ADCEISTAT1__EIRDY23" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 24" mask="0x01000000" name="EIRDY24" values="ADCEISTAT1__EIRDY24" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 25" mask="0x02000000" name="EIRDY25" values="ADCEISTAT1__EIRDY25" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 26" mask="0x04000000" name="EIRDY26" values="ADCEISTAT1__EIRDY26" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 27" mask="0x08000000" name="EIRDY27" values="ADCEISTAT1__EIRDY27" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 28" mask="0x10000000" name="EIRDY28" values="ADCEISTAT1__EIRDY28" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 29" mask="0x20000000" name="EIRDY29" values="ADCEISTAT1__EIRDY29" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 30" mask="0x40000000" name="EIRDY30" values="ADCEISTAT1__EIRDY30" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 31" mask="0x80000000" name="EIRDY31" values="ADCEISTAT1__EIRDY31" />
         </register>
