Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAR176.atdf
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA26" offset="0x9f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA26" offset="0x19f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN Module Message Index Register " name="C1FIFOCI26" offset="0xa00" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI26" offset="0x1a00" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN FIFO Control Register " name="C1FIFOCON27" offset="0xa10" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON27__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON27__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON27__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C1FIFOCON27__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C1FIFOCON27__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C1FIFOCON27__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON27__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C1FIFOCON27__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON27__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON27__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C1FIFOCON27__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C2FIFOCON27" offset="0x1a10" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C2FIFOCON27__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C2FIFOCON27__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C2FIFOCON27__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C2FIFOCON27__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C2FIFOCON27__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C2FIFOCON27__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C2FIFOCON27__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C2FIFOCON27__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C2FIFOCON27__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C2FIFOCON27__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C2FIFOCON27__FSIZE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT27" offset="0xa20" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT27__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT27__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT27__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT27__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT27__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT27__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT27__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT27__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT27__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT27__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT27__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT27__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT27__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT27__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT27" offset="0x1a20" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT27__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT27__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT27__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT27__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT27__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT27__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT27__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT27__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT27__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT27__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT27__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT27__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT27__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT27__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA27" offset="0xa30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA27" offset="0x1a30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
