Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAR176.atdf
         <register caption="" name="SBT2REG0" offset="0x820" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT2REG1" offset="0x840" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT2REG2" offset="0x860" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG0" offset="0xc20" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG1" offset="0xc40" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT3REG2" offset="0xc60" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT4REG0" offset="0x1020" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT4REG1" offset="0x1040" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT4REG2" offset="0x1060" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT4REG3" offset="0x1080" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG3__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG3__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT4REG4" offset="0x10a0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG4__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG4__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT5REG0" offset="0x1420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT5REG1" offset="0x1440" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT5REG2" offset="0x1460" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT5REG3" offset="0x1480" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG3__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG3__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT5REG4" offset="0x14a0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT5REG4__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT5REG4__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT6REG0" offset="0x1820" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT6REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT6REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT6REG1" offset="0x1840" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT6REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT6REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT7REG0" offset="0x10420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT7REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT7REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT7REG1" offset="0x10440" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT7REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT7REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT7REG2" offset="0x10460" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT7REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT7REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT8REG0" offset="0x10820" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT8REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT8REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT8REG1" offset="0x10840" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT8REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT8REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT9REG0" offset="0x10C20" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT9REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT9REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT9REG1" offset="0x10C40" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT9REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT9REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT10REG0" offset="0x11020" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT10REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT10REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
